tap "anomalyco/tap"
tap "gromgit/brewtils"
tap "guumaster/tap"
tap "jesseduffield/lazygit"
tap "jstkdng/programs"
tap "kardolus/chatgpt-cli"
tap "koekeishiya/formulae"
tap "mongodb/brew"
tap "nikitabobko/tap"
tap "noahgorstein/tap"
tap "oven-sh/bun"
tap "plutov/tap"
tap "rockymadden/rockymadden"
tap "samtay/tui"
tap "thefox/brewery"
tap "ymtdzzz/tap"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Automate deployment, configuration, and upgrading
brew "ansible"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# C library implementing the SSH2 protocol
brew "libssh2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Cross-platform make
brew "cmake"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Run arbitrary commands when files change
brew "entr"
# VP8/VP9 video codec
brew "libvpx"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Automatic git commit --fixup
brew "git-absorb"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Library access to GnuPG
brew "gpgme"
# Tool for glamorous shell scripts
brew "gum"
# OpenType text shaping engine
brew "harfbuzz"
# Fast and multi-purpose HTTP toolkit
brew "httpx"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Image loading and rendering library
brew "imlib2"
# Lightweight and flexible command-line JSON processor
brew "jq"
# TUI playground to experiment and play with jq
brew "jqp"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Simple terminal UI for git commands
brew "lazygit"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Blu-Ray disc playback library for media players like VLC
brew "libbluray"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# X.Org: X Toolkit Intrinsics library
brew "libxt"
# Powerful, lightweight programming language
brew "lua"
# Mac App Store command-line interface
brew "mas"
# Terminal image, video, directory, and Markdown viewer
brew "mcat"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Development kit for the Java programming language
brew "openjdk"
# Framework for layout and rendering of i18n text
brew "pango"
# Password manager
brew "pass"
# Process Management Interface for HPC environments
brew "pmix"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Terminal slideshow tool
brew "presenterm"
# Python version management
brew "pyenv"
# Easily download, build, install, upgrade, and uninstall Python packages
brew "python-setuptools"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Database management TUI for PostgreSQL/MySQL/SQLite
brew "rainfrog"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Secure Reliable Transport
brew "srt"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Command-line time tracking application
brew "timewarrior"
# Terminal multiplexer
brew "tmux"
# Command-line interface for Vercel
brew "vercel-cli"
# Executes a program periodically, showing output fullscreen
brew "watch"
# CLI for Git worktree management, designed for parallel AI agent workflows
brew "worktrunk"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Tracks most-used directories to make cd smarter
brew "z"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Electronics prototyping platform
cask "arduino-ide"
# 3D model slicing software for 3D printers, maintained by Bambu Lab
cask "bambu-studio"
# Open source IDE for exploring and testing APIs
cask "bruno"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Cross-platform Text Expander written in Rust
cask "espanso"
# Collaborative team software
cask "figma"
cask "font-hack-nerd-font"
cask "font-mononoki-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp"
# Extensible, firefox-based web browser
cask "glide-browser"
# Jellyfin desktop client
cask "jellyfin-media-player"
# Free and Open Source Video Editor
cask "kdenlive"
# Open-source keystroke visualiser
cask "keycastr"
# ZSA keyboard firmware flasher
cask "keymapp"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Free and open-source RSS reader
cask "netnewswire"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Programmable solid 3D CAD modeller
cask "openscad"
# Terminal OpenAPI Spec viewer
cask "plutov/tap/oq"
# Browser for ambitious developers
cask "polypane"
# File sharing network
cask "soulseek"
# Video game digital distribution service
cask "steam"
# Quicklook extension for source files
cask "syntax-highlight"
# Messaging app with a focus on speed and security
cask "telegram"
# Open-source BitTorrent client
cask "transmission"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
# Multimedia player
cask "vlc"
mas "Manet", id: 6470928235
mas "Slack", id: 803453959
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/ramya-rao-a/go-outline"
go "github.com/fatih/gomodifytags"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "github.com/josharian/impl"
go "github.com/szktkfm/mdtt/cmd/mdtt"
go "github.com/guyfedwards/nom/cmd/nom"
go "honnef.co/go/tools/cmd/staticcheck"
